---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDirn2
source: html/7a8cbea4-3313-9ceb-3cd9-051f39b7ac59.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDirn2 Property

"Top Minor Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpacingTopDirn2 { get; }
```